<?php

use Illuminate\Database\Seeder;

class TopicSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('forum_topics')->insert([
            [
                'topic_author_id' => 1,
                'topic_category_id' => 2,
                'topic_title' => 'ทำไมแมวน้ำถึงไม่นิยมเลี้ยงในบ้านเหมือนแมวบ้านครับ ผมหมายถึงในเกมนะครับๆๆๆๆ',
                'topic_content' => 'เฟิร์มโฟมบลอนด์ แพทยสภาตรวจสอบเทรนด์ แฮมเบอร์เกอร์คอร์สทริปเอ็นเตอร์เทนรีสอร์ต ปัจเจกชน โหงวต่อยอดคอร์ส ฟอร์มล็อตแม็กกาซีนโรแมนติคเปโซ ชัตเตอร์ดีพาร์ตเมนต์ชิฟฟอนเอ็กซ์เพรส สไตล์﻿กรรมาชนไหร่ แพทเทิร์นอิ่มแปร้ม้งเอาท์ดอร์ คลิป จิ๊กแพ็คเป็นไงเทรด จูนซัพพลายแชมป์สเตริโอเลดี้ คันธาระล็อตกฤษณ์ ศิลปากรอิมพีเรียลพาสเจอร์ไรส์ โบว์แป๋วการันตีอัตลักษณ์เฟอร์รี่ เทรนด์เฝอเพียบแปร้วโรกาสวิลเลจ โรแมนติค เซ็กซ์อุปทานแกรนด์เมคอัพ เวอร์ แซนด์วิชว้อยแคปแพทยสภา วานิลาถูกต้องอัลบัมแช่แข็ง ก่อนหน้าแดนซ์ฮองเฮาแครอท นาฏยศาลา คาวบอยซูโม่รองรับดีพาร์ตเมนต์ ภคันทลาพาธกรุ๊ปกรอบรูป อิสรชนแรลลี เทียมทานวาริชศาสตร์แอคทีฟแฟกซ์ ถ่ายทำอพาร์ตเมนท์บอกซ์ รีดไถภารตะแคมเปญ แยมโรล แคนยอนมวลชนสป็อตโดมิโนคันธาระชนะเลิศ เฟอร์รี่คอมพ์บลอนด์สเตเดียมแกรนด์ ออกแบบวโรกาสสุนทรีย์ฟรุต แพทยสภาแคร็กเกอร์ตัวตน ตุ๋ยคอร์ปอเรชั่นบาร์บีคิว โฮปอัลบัม แอดมิสชันลามะพงษ์ รองรับแฟกซ์คอลัมนิสต์ ไอเดียไดเอ็ตฮีโร่ซามูไร พุทธศตวรรษทับซ้อนสต็อคบิลคาสิโน แคทวอล์ค มิวสิค อพาร์ตเมนต์เลดี้ รองรับ พันธุวิศวกรรมเมาท์ แฮนด์ติ่มซำแอปพริคอทชนะเลิศรากหญ้าเทค เคลียร์เบบี้ปิโตรเคมีโปรเจกต์ โดนัท เซรามิก แบล็คแฟรีแพกเกจ วาไรตี้ดอกเตอร์ต่อยอดเก๊ะ เพลย์บอย ชิฟฟอนแอปเปิ้ลดั๊มพ์ เซ่นไหว้ภควัมปติคาร์แคร็กเกอร์ การันตีล็อตพันธุวิศวกรรมบลอนด์ สเตย์ทิปสามช่าแจ๊สสหรัฐ คันยิตื้บซัพพลาย เวสต์แต๋วพฤหัสสเก็ตช์หน่อมแน้ม แพนดารุสโซกรอบรูปเทียมทานมั้ย ปาสเตอร์ ท็อปบูตยังไงจูนโพสต์สเตชัน เอนทรานซ์ วินสคริปต์ เยลลี่แครกเกอร์คอมพ์บาบูน พล็อตเซ็นทรัลไชน่าอีสต์สะบึม เยอบีร่าแช่แข็งฮิตพุทธภูมิ ตุ๊ดปาสเตอร์ เมเปิลลิมิตสหรัฐ แบคโฮแจ๊สเวิร์กอุปนายกคอลเล็กชั่น เอ็นเตอร์เทนแรงผลัก เอาท์ ฮากกาไฟลต์ ชัตเตอร์มาร์เก็ต คอนโดสถาปัตย์เฟิร์มสเตย์ แอปเปิ้ล เอ็นเตอร์เทนสะกอม',
                'topic_views' => 21,
                'topic_is_published' => 1,
            ],
            [
                'topic_author_id' => 1,
                'topic_category_id' => 3,
                'topic_title' => 'เอาลุงตู่ไปทำเขื่อนได้ไหมครับ น้ำจะได้ไม่ท่วมกรุงเทพ ทุกคนคิดว่าไงครับ',
                'topic_content' => 'ฟอร์มล็อตแม็กกาซีนโรแมนติคเปโซ จิ๊กแพ็คเป็นไงเทรด  ศิลปากรอิมพีเรียลพาสเจอร์ไรส์ เทรนด์เฝอเพียบแปร้วโรกาสวิลเลจ โรแมนติค เซ็กซ์อุปทานแกรนด์เมคอัพ เวอร์ แซนด์วิชว้อยแคปแพทยสภา วานิลาถูกต้องอัลบัมแช่แข็ง ก่อนหน้าแดนซ์ฮองเฮาแครอท นาฏยศาลา คาวบอยซูโม่รองรับดีพาร์ตเมนต์ ภคันทลาพาธกรุ๊ปกรอบรูป อิสรชนแรลลี เทียมทานวาริชศาสตร์แอคทีฟแฟกซ์ ถ่ายทำอพาร์ตเมนท์บอกซ์ รีดไถภารตะแคมเปญ แยมโรล แคนยอนมวลชนสป็อตโดมิโนคันธาระชนะเลิศ เฟอร์รี่คอมพ์บลอนด์สเตเดียมแกรนด์ ออกแบบวโรกาสสุนทรีย์ฟรุต แพทยสภาแคร็กเกอร์ตัวตน ตุ๋ยคอร์ปอเรชั่นบาร์บีคิว โฮปอัลบัม แอดมิสชันลามะพงษ์ รองรับแฟกซ์คอลัมนิสต์ ไอเดียไดเอ็ตฮีโร่ซามูไร พุทธศตวรรษทับซ้อนสต็อคบิลคาสิโน แคทวอล์ค มิวสิค อพาร์ตเมนต์เลดี้ รองรับ พันธุวิศวกรรมเมาท์ แฮนด์ติ่มซำแอปพริคอทชนะเลิศรากหญ้าเทค เคลียร์เบบี้ปิโตรเคมีโปรเจกต์ โดนัท เซรามิก แบล็คแฟรีแพกเกจ วาไรตี้ดอกเตอร์ต่อยอดเก๊ะ เพลย์บอย ชิฟฟอนแอปเปิ้ลดั๊มพ์ เซ่นไหว้ภควัมปติคาร์แคร็กเกอร์ การันตีล็อตพันธุวิศวกรรมบลอนด์ สเตย์ทิปสามช่าแจ๊สสหรัฐ คันยิตื้บซัพพลาย เวสต์แต๋วพฤหัสสเก็ตช์หน่อมแน้ม แพนดารุสโซกรอบรูปเทียมทานมั้ย ปาสเตอร์ ท็อปบูตยังไงจูนโพสต์สเตชัน เอนทรานซ์ วินสคริปต์ เยลลี่แครกเกอร์คอมพ์บาบูน พล็อตเซ็นทรัลไชน่าอีสต์สะบึม เยอบีร่าแช่แข็งฮิตพุทธภูมิ ตุ๊ดปาสเตอร์ เมเปิลลิมิตสหรัฐ แบคโฮแจ๊สเวิร์กอุปนายกคอลเล็กชั่น เอ็นเตอร์เทนแรงผลัก เอาท์ ฮากกาไฟลต์ ชัตเตอร์มาร์เก็ต คอนโดสถาปัตย์เฟิร์มสเตย์ แอปเปิ้ล เอ็นเตอร์เทนสะกอม',
                'topic_views' => 17,
                'topic_is_published' => 1,
            ]
        ]);
    }
}
